---
title: PointFailures
classe: Autodesk.Revit.DB.BuiltInFailures+PointFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# PointFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotMakePointHostedByIntersection { get; }` | `PointFailures.CannotMakePointHostedByIntersection` | FailureDefinitionId |
| `FailureDefinitionId CantChangeParamFlip { get; }` | `PointFailures.CantChangeParamFlip` | FailureDefinitionId |
| `FailureDefinitionId CantChangeParamMirror { get; }` | `PointFailures.CantChangeParamMirror` | FailureDefinitionId |
| `FailureDefinitionId CantChangeParamRotate { get; }` | `PointFailures.CantChangeParamRotate` | FailureDefinitionId |
| `FailureDefinitionId EdgeHostedPointToBeUnhosted { get; }` | `PointFailures.EdgeHostedPointToBeUnhosted` | FailureDefinitionId |
| `FailureDefinitionId HostMeasurementError { get; }` | `PointFailures.HostMeasurementError` | FailureDefinitionId |
| `FailureDefinitionId HostParameterRangeError { get; }` | `PointFailures.HostParameterRangeError` | FailureDefinitionId |
| `FailureDefinitionId RegenFailure { get; }` | `PointFailures.RegenFailure` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```